app/Controllers/Register.php

INSERT INTO `Practitioner` (`firstname`, `lastname`, `phone`, `email`, `nic`, `doctorid`, `specialization`, `address`, `password`) VALUES ('ali', 'yahya', '0772356894', 'yahyaali@gmail.com', '200012334568', '00006', 'Oncologist', '               test 3 ', '$2y$10$lvTryQB/dSbvbbjbzheg5eN8h5zM5gj4LTjWwEPHu73.UzVMlu2FK')
---
    public function PracCreate()
    {
        $formdata = $this->request->getPost(); // Gets data from the registration form's post method
        // $validation =  \Config\Services::validation(); // Validation library is loaded

            // get the data from the form
            $email = $this->request->getPost('email');
            $model = new \App\Models\prac_model;

            // If the validations are successful
            $users = new \App\Entities\Practitioner($this -> request ->getPost());
            $users -> password = password_hash($users->password, PASSWORD_DEFAULT); // Hashes the password

            // Inserts account registration information into the database
            $model->insert($users);

INSERT INTO `Patient` (`firstname`, `lastname`, `phone`, `email`, `nic`, `address`, `password`) VALUES ('Yahya', 'Ali', '0775974661', 'aliyahya@gmial.com', '123354667894', 'colombo', '$2y$10$exlUcqjHL3lVy0R9oX4xgemBROU26d.OzvAJ2y1OY7YZ4.XGpzaJO')
---
    public function PatCreate()
    {
        $formdata = $this->request->getPost(); // Gets data from the registration form's post method
        // $validation =  \Config\Services::validation(); // Validation library is loaded

            // get the data from the form
            $email = $this->request->getPost('email');
            $model = new \App\Models\patient_model;

            // If the validations are successful
            $users = new \App\Entities\Patient($this -> request ->getPost());
            $users -> password = password_hash($users->password, PASSWORD_DEFAULT); // Hashes the password

            // Inserts account registration information into the database
            $model->insert($users);